{
    "CS 550" : {
        "instrName" : "Mahmood Riyadh",
        "location" : "Distance Learning Course (Online)",
        "description" : "This is a graduate Database Systems course designed to provide students with both the theoretical knowledge\nand practical hands-on project experience on how to design and develop database applications and\ninformation systems using Relational Database Management Systems.",
        "timings" : "Asynchronous"
    },
    "SWE 632" : {
        "instrName" : "Dimitri Kaznachey",
        "location" : "Sandbridge Hall | Room: 107",
        "description" : "This course covers human-computer interaction, user interface design and development, including need-finding, prototyping, user-centered design, usability evaluation methods, and design principles for visual, information, interaction, and community design.",
        "timings" : "Monday | 7:20pm - 10:00pm"
    },
    "INFS 740" : {
        "instrName" : "Reza Hemayati",
        "location" : "Art Building | Room: 2026",
        "description" : "Information systems accessible through web and Internet are becoming prevalent. Course focuses on technologies and industry standards for accessing and manipulating persistent data that are suitable for web applications.",
        "timings" : "Wednesday | 4:30pm - 7:10pm"
    },
    "CS 795" : {
        "instrName" : "Linda Smith",
        "location" : "Engineering Building | Room: 3030",
        "description" : "Advanced topics not occurring in regular sequence. Notes: May be repeated for credit when subject differs. Satisfies MS breadth requirement only if explicitly stated in syllabus in given section. ",
        "timings" : "Thursday | 6:00pm - 8:40pm"
    },
    "CS 551" : {
        "instrName" : "John Johnson",
        "location" : "Innovation Hall | Room: 109",
        "description" : "Graphics principles and programming. Topics include graphics hardware, antialiasing, transformations, viewing, illumination, blending, texture mapping, color models, curves, surfaces, and animation.",
        "timings" : "Tuesday | 1:30pm - 4:10pm"
    },
    "CS 695" : {
        "instrName" : "Amy Lee",
        "location" : "Exploratory Hall | Room: 3010",
        "description" : "Special topics in computer science not occurring in regular computer science sequence. Previous courses include Natural Language Processing, Embedded Systems, etc. This course can be reelected with different topic and can be considered as a separate course",
        "timings" : "Wednesday | 6:00pm - 8:40pm"
    },
    "CS 583" : {
        "instrName" : "Michael Brown",
        "location" : "Art and Design Building | Room: 1040",
        "description" : "This course covers algorithmic strategies like greedy, divide and conquer, dynamic programming, search and traversal, and approximation, and analyzes algorithms in these categories, including NP-Hard and NP-Complete problems.",
        "timings" : "Tuesday | 9:00am - 11:40am"
    },
    "STAT 550" : {
        "instrName" : "Jennifer Kim",
        "location" : "Exploratory Hall | Room: 2040",
        "description" : "Special topics in applied statistics of interest to graduate students in statistics certificate programs. Notes: May be repeated for credit when topic is different.",
        "timings" : "Monday | 9:00am - 11:40am"
    },
    "MATH 650" : {
        "instrName" : "David Lee",
        "location" : "Art and Design Building | Room: 3080",
        "description" : "",
        "timings" : "Wednesday | 1:30pm - 4:10pm"
    },
    "ECON 420" : {
        "instrName" : "Susan Park",
        "location" : "Innovation Hall | Room: 101",
        "description" : "",
        "timings" : "Friday | 9:00am - 11:40am"
    },
    "CHEM 430" : {
        "instrName" : "Michael Davis",
        "location" : "Planetary Hall | Room: 3030",
        "description" : "",
        "timings" : "Thursday | 1:30pm - 4:10pm"
    },
    "PHYS 650" : {
        "instrName" : "Karen Johnson",
        "location" : "Art and Design Building | Room: 1080",
        "description" : "",
        "timings" : "Tuesday | 1:30pm - 4:10pm"
    },
    "ENG 520" : {
        "instrName" : "James Wilson",
        "location" : "Engineering Building | Room: 1020",
        "description" : "",
        "timings" : "Wednesday | 9:00am - 11:40am"
    },
    "MKTG 630": {
        "instrName": "Jennifer Kim",
        "location": "Exploratory Hall | Room: 2040",
        "description": "This is a graduate course designed to provide students with an understanding of the principles of marketing, including market segmentation, consumer behavior, product development, pricing, promotion, and distribution. ",
        "timings": "Thursday | 4:30pm - 7:10pm"
    },
    "FIN 620": {
        "instrName": "David Lee",
        "location": "Exploratory Hall | Room: 3010",
        "description": "This course provides a comprehensive overview of the financial management principles and practices in corporations. Topics covered include capital budgeting, financial statement analysis, risk and return, cost of capital, capital structure, dividend policy, and working capital management. ",
        "timings": "Monday | 4:30pm - 7:10pm"
    },
    "MATH 550": {
        "instrName": "Michael Brown",
        "location": "Art and Design Building | Room: 1040",
        "description": "This course covers advanced topics in linear algebra and numerical methods, including matrix factorization, eigenvalue problems, singular value decomposition, iterative methods, and numerical optimization. Applications to data analysis, machine learning, and scientific computing will be emphasized.",
        "timings": "Wednesday | 9:00am - 11:40am"
    },
    "PHYS 750": {
        "instrName": "Karen Johnson",
        "location": "Planetary Hall | Room: 3030",
        "description": "This course covers advanced topics in quantum mechanics, including angular momentum, perturbation theory, scattering, and time-dependent phenomena. Applications to atomic physics, condensed matter physics, and quantum information will be discussed. ",
        "timings": "Tuesday | 4:30pm - 7:10pm"
    },
    "CS 680": {
        "instrName": "Amy Lee",
        "location": "Innovation Hall | Room: 109",
        "description": "This course covers the principles and practice of software engineering, including requirements analysis, design patterns, testing, debugging, and maintenance. Emphasis is placed on developing high-quality, reliable, and scalable software systems using modern software development tools and techniques. ",
        "timings": "Thursday | 9:00am - 11:40am"
    },
    "SWE 690": {
        "instrName": "Dimitri Kaznachey",
        "location": "Engineering Building | Room: 3030",
        "description": "This course covers advanced topics in software engineering, including software architecture, software metrics, software reuse, software evolution, and software project management. Emphasis is placed on developing practical skills for managing large-scale software projects and software development teams. ",
        "timings": "Monday | 1:30pm - 4:10pm"
    },
    "STAT 610": {
        "instrName": "Linda Smith",
        "location": "Exploratory Hall | Room: 2040",
        "description": "This course covers advanced topics in statistical inference, including estimation, hypothesis testing, confidence intervals, and Bayesian methods. Applications to experimental design, survey sampling, and data analysis will be emphasized. ",
        "timings": "Tuesday | 9:00am - 11:40am"
    }
}
